import React from 'react';

const TZ = () =>
<div>
    <ul>
        <li>По нажатию на кнопку "New Task" справа выезжает форма добавления новой задачи.</li>

        <li>Текст вверху формы должен автогенерироваться на основании выбранных ниже опций и введенного текста.</li>

        <li>Реализовать добавление, редактирование и удаление задач. Добавить валидации для формы.</li>

        <li>Сделать карту рабочей, то есть по клику на карту поле Location заполняется адресом, соответствующим выбранной точке</li>

        <li>Сохранять данные при перезагрузке страницы, для этого использовать local storage, либо любой бекенд (например Firebase).</li>

        <li>Код выполненного задания выложить на github с описанием шагов для запуска приложения.</li>

        <li>Добавить роутинг</li>

        <li>Добавить модалки для подтверждения действий</li>

        <li>Добавить возможность залогиниться используюя google и/или facebook</li>

        <li>Добавить возможность посмотреть историю</li>

        <li>Использование БЭМ в верстке</li>
    </ul>
    <img src="/assets/Client dashboard.png" width="100%" alt="preview"/>
</div>

export default TZ;
